---
kind: other
id: Methods.T:Autodesk.Revit.DB.AssemblyViewUtils
source: html/5dbf6f6d-dee0-d39c-c1b7-1a0f4fc385c8.htm
---
# AssemblyViewUtils Methods

Transfers the assembly views owned by a source assembly instance to a target sibling assembly instance of the same assembly type.